# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [4]:
ser1 = pd.Series(data = np.random.randint(1, 5, size = 100), name = 'first')
ser2 = pd.Series(data = np.random.randint(1, 4, size = 100), name = 'second')
ser3 = pd.Series(data = np.random.randint(10000, 30001, size = 100), name = 'third')

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
df = pd.concat([ser1, ser2, ser3], axis = 'columns')
df

    first  second  third
0       2       3  16788
1       3       2  18732
2       3       1  12164
3       2       1  21385
4       3       1  21608
..    ...     ...    ...
95      4       1  19920
96      1       3  11573
97      3       1  14754
98      4       1  16616
99      3       2  17197

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [27]:
df.rename(columns = {'first' : 'bedrs', 'second' : 'bathrs', 'third' : 'price_sqr_meter'}, inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0   first       3            16788
1   first       2            18732
2   first       1            12164
3   first       1            21385
4   first       1            21608
..    ...     ...              ...
95  first       1            19920
96  first       3            11573
97  first       1            14754
98  first       1            16616
99  first       2            17197

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [48]:
bigcolumn = pd.concat([ser1, ser2, ser3])
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       2
1       3
2       3
3       2
4       3
..    ...
95  19920
96  11573
97  14754
98  16616
99  17197

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [49]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [60]:
bigcolumn.reset_index(drop = True, inplace = True)
bigcolumn

         0
0        2
1        3
2        3
3        2
4        3
..     ...
295  19920
296  11573
297  14754
298  16616
299  17197

[300 rows x 1 columns]